Revit 2024 API
LeaderShape Enumeration
 Supported geometric shapes of annotation leaders.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Since: 2016
Syntax
C#
public enum LeaderShape
Visual Basic
Public Enumeration LeaderShape
Visual C++
public enum class LeaderShape
Members
Member name | Description
Straight |  A single straight line between the end point and anchor point.
Kinked |  A kinked line with a shoulder defined by an elbow point.
Arc |  An arc between between the end point and anchor point. In this shape the elbow point controls the arc's radius.
Remarks
 Although the Leader class supports all available shapes, not all types of leaders may have the option to change its shape. For example, leaders of text annotations can be of any shape, while leaders of level lines are never curved.
See Also
Autodesk.Revit.DB Namespace